{
     "intents": [
        {
          "tag": "greeting",
          "patterns": ["Hi", "How are you", "Is anyone there?", "Hello", "Good day", "Good morning", "Good evening", "Good afternoon","Hii"],
          "responses": ["Hello!", "Good to see you again!", "Hi there, how can I help?"],
          "context_set": ""
        },
       {
         "tag": "electronic",
         "patterns": ["What is Electronic Signature Certificate (ESC)?",""],
         "responses": ["Digital signatures are electronically generated and can be used to ensure the integrity and authenticity of some data and protect against non-repudiation. It is a form of an electronic credential on the Internet. After the enactment of Information Technology Act 2000 in India, Electronic Signatures are legally valid in India. It is commonly abbreviated as ESC/DSC."]
       },
       {
         "tag": "classes",
         "patterns": ["What are different classes of ESC/DSC?"],
         "responses": ["Classes of ESC/DSCs a Certifying Authority can issue are:\n- Class 1 : It is generally used for basic level of assurance. However this is the least popular in India.\n- Class 2 & Class 3 (Signing only): Class 3 individual signing certificates is a combination of both class 2 & class 3 certificates for both Personal & organizational. It includes Class 2 OID in the Class 3 certificates which will be qualified as both class 2 & class 3 individual signing certificates. These certificates are issued for both business personnel and private individuals use. These certificates are majorly used for moderate risk of transactions, eg: Income Tax efiling & MCA-21.\n- Class 3 (Signing and Encryption) : This certificate is issued to individuals as well as organizations where threat to data are high. These certificates are majorly used for eTendering and IRCTC eTicketing.\n- Special Purpose Certificate : Secure Socket Layer (SSL) and Document Signer Certificate are special purpose certificates used for Website (HTTPS) and bulk signing at the server respectively."]
       },
       {
         "tag": "validity",
         "patterns": ["What is the validity of DSC available?"],
         "responses": ["A DSC can be issued upto three year validity. The difference is in the commercials. 2 yr DSC is marginally higher than 1 yr DSC so is 3 year DSC costlier than 2 year validity DSC."]
       },
       {
         "tag": "encrypt",
         "patterns": ["What is the difference between Only Sign and Sign + Encrypt Certificate?"],
         "responses": ["Class 2 and Class 3 is issued in two categories - Only Sign DSC and Sign + Encryption DSC.\n- With Only Sign Certificate, one can Sign the data to ensure the Data integrity and non-repudiation. Such types of certificates are majorly used for Income Tax eFiling, MCA-21, DGFT, GSTN, eTicketing, Sign Invoices, Sign Purchase Orders, etc.\n- 1. With Sign + Encrypt, apart from Signing, one can also Encrypt the data to protect it from the unauthorized access of data. These are majorly used for eTendering services."]
       },
       {
         "tag": "decision",
         "patterns": ["Who decides what Class and Type of DSC I require?"],
         "responses": ["It is decided by the Application owner (like Govt. website, eTendering portal, MCA-21 website, Income tax portal, GSTN, etc) i.e Application, where you intend to use the DSC. For example, if you plan to use the DSC at MCA-21 Website, MCA-21 decides what class and type of certificate you have to procure from a Certifying Authority, in India."]
       },
       {
         "tag": "OID",
         "patterns": ["What is OID?"],
         "responses": ["OID stand for Object Identifier, OID is used to differentiate one class of certificates from another as per CCA IVG Guidelines and also indicate which CA has used what OID in the DSC and helps software applications to easily validate DSC programatically."]
       },
       {
         "tag": "CPS",
         "patterns": ["What is CPS?"],
         "responses": ["CPS stand for Certification Practice Statement. It is basically a detailed statement of the DSC issuance practices and operational procedures to issue a DSC to the subscriber. Every Certifying Authority will have different CPS, which is generalized by CCA. Our CPS is available at our website - www.ncodesolutions.com"]
       },
       {
         "tag": "agreement",
         "patterns": ["What is Subscriber Agreement?"],
         "responses": ["A Subscriber Agreement is an agreement between Subscriber and (n)Code Solutions CA stating that, subscriber is solely responsible for the protection of the Private key in Crypto Token and ensuring functionality of his/her key pair. Subscriber also agrees that all the information provided to (n)Code is correct. (n)Code Solutions CA will not be responsible for any legal disputes arising due to misrepresentation on the part of subscriber. The subscriber agreement is available at our website: www.ncodesolutions.com"]
       },
       {
         "tag": "revocation",
         "patterns": ["What is Revocation and how can I Revoke my DSC?"],
         "responses": ["A DSC can be revoked under circumstances like:\n- Users suspect compromise of certificate private key.\n- 1. Change of personal data.\n- 2. Change of relationship with the organization. To revoke your DSC, download the revocation form available at our website [liink](www.ncodesolutions.com)\n- 3. Raise the revocation request by sending mail to revoke@ncode.in from the registered email ID while buying DSC. (n)Code can ask for more information in case of any doubt before DSC gets Revoked.\n- 4. The subscriber can submit filled & signed revocation form along with id proof to nearest (n)Code office or RA."]
       },
       {
         "tag": "token",
         "patterns": ["What is a USB Token?"],
         "responses": ["The X.509 Certificate Policy for India PKI mandates that the private key of the DSC of the subscriber should be stored only in a Cryptographic token ( which resembles a pen drive). There are four major makes of USB Token available - ePass, mToken, Watchdata. USB Token is must to obtain a DSC. Pls refer to www.cca.gov.in for CCA Crypto guidelines.."]
       },
       {
         "tag": "act",
         "patterns": ["IT ACT and Amendment (for reference)"],
         "responses": ["1. IT Act 2000: http://meity.gov.in\n- 2. IT (Amendment) Act 2008 : http://meity.gov.in\n- 3. Other details can be accessed at website managed by CCA office. www.cca.gov.in"]
       },
       {
         "tag": "grievance",
         "patterns": ["Grievance redressal or Feedback Sharing"],
         "responses": ["At (n)Code we truly believe in providing best in class services to our customers. We aim to understand both our strengths and shortcomings from our customer's point of view and work across to meet their needs. If you are not satisfied with the service received or you have a feedback to share w.r.t to the services availed, you can draw our attention either by calling us at our toll free no. 6356 - 894 - 444 or or by writing to us at dscsupport@ncode.in, dscsupport1@ncode.in"]
       }
     ]
   }
   